etc/templates/inflowOutflowRotating/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.5e-05;

BirdCarreauCoeffs
{
    nu0             [0 2 -1 0 0 0 0] 1e-03;
    nuInf           [0 2 -1 0 0 0 0] 1e-05;
    k               [0 0  1 0 0 0 0] 1;
    n               [0 0  0 0 0 0 0] 0.5;
}

CrossPowerLawCoeffs
{
    nu0             [0 2 -1 0 0 0 0] 1e-03;
    nuInf           [0 2 -1 0 0 0 0] 1e-05;
    m               [0 0  1 0 0 0 0] 1;
    n               [0 0  0 0 0 0 0] 0.5;
}

powerLawCoeffs
{
    nuMax           [0 2 -1 0 0 0 0] 1e-03;
    nuMin           [0 2 -1 0 0 0 0] 1e-05;
    k               [0 2 -1 0 0 0 0] 1e-05;
    n               [0 0  0 0 0 0 0] 1;
}

HerschelBulkleyCoeffs
{
    nu0             [0 2 -1 0 0 0 0] 1e-03;
    tau0            [0 2 -2 0 0 0 0] 1;
    k               [0 2 -1 0 0 0 0] 1e-05;
    n               [0 0  0 0 0 0 0] 1;
}

// ************************************************************************* //
